clear all;
close all;

% 设置学习率、惯性项和网络结构参数
xite = 0.05;% 冲量
alfa = 0.01;% 学习率
IN = 4;
H = 10;

Out = 3;

upper_bound = 0.5;
lower_bound = -0.5;

% 初始化输入到隐藏层的权重矩阵和输出层的权重矩阵
% wi = [ 0.4634 -0.4173  0.3190  0.0
%        0.1839  0.3021  0.1112  0.0
%       -0.3182  0.0470  0.0850 -0.00
%       -0.6266  0.0846  0.3751 -0.6900
%       -0.3224  0.1440 -0.2873 -0.0193
%       -0.0232 -0.0992  0.2636  0.2011
%       -0.4502 -0.2928  0.0062 -0.5640
%       -0.1975 -0.1332  0.1981  0.0422
%        0.0521  0.0673 -0.5546 -0.4830
%       -0.6016 -0.4097  0.0338 -0.1503
%     ];
wi = [
    -0.0852888573389957	0.000253057003004446	0.312531732925531	-0.159499887058704
    -0.130942172108626	-0.0152950825831614	-0.0122034754701159	0.365904558667291
    0.404744923630016	0.469302500027405	0.386496020957230	0.256258266291791
    -0.0886423440346995	-0.382271570941441	0.00316049031212739	0.455760712803700
    -0.331871205728564	-0.210516192756304	0.0184579911005753	0.451946440514327
    0.0242503050746756	-0.0461920653909089	-0.00291862113686861	-0.373085389837674
    0.317786087283270	0.0703474682330038	-0.292177819098093	-0.135197948391224
    -0.107483175684636	0.382183438501428	-0.410793861245098	0.469308165126654
    0.280575789328982	0.00528310152054737	-0.383914405182408	0.197815340001006
    0.201270007347419	-0.0182955776941348	0.417470817757304	0.479859752842609
];
% wi = lower_bound + (upper_bound - lower_bound) * rand(H, 4);
wi_1 = wi; wi_2 = wi; wi_3 = wi;
wo = [
    -0.167954574684851	-0.221224626343642	-0.509685543572882
    -0.636091904932626	-0.640007524599872	0.229681460162353
    -0.0273046356868542	-0.0413635310772897	-0.554808194031124
    -0.419089617010515	0.307790208075708	-0.297624878873010
    -0.122751017345016	-0.554738456572048	-0.0567644123341584
    0.0748069812355894	-0.614594416741501	-0.0650033416430570
    -0.0427691889767144	0.236050131204102	0.0174967840628536
    -0.0618185343263991	-0.403243615064153	-0.00215786506594495
    -0.216750140088592	-0.641269923868312	-0.216815912783058
    -0.406012086614625	0.164735291326390	-0.510426221022391    
];
% wo = [-0.1620  0.3674  0.1959
%       -0.0337 -0.1563 -0.1454
%        0.0898  0.7239  0.7605
%        0.3349  0.7683  0.4714
%        0.0215  0.5896  0.7143
%       -0.0914  0.4666  0.0771
%        0.4270  0.2436  0.7026
%        0.0215  0.4400  0.1121
%        0.2566  0.2486  0.4857
%        0.0198  0.4970  0.6450
%     ];
% wo = lower_bound + (upper_bound - lower_bound) * rand(H, 3);
wo_1 = wo; wo_2 = wo; wo_3 = wo;

% 初始化变量
x = [0, 0, 0];
u_1 = 0; u_2 = 0; u_3 = 0; u_4 = 0; u_5 = 0;
y_1 = 0; y_2 = 0; y_3 = 0;

Oh = zeros(H, 1);
I = Oh;
error_2 = 0;
error_1 = 0;

ts = 0.01;% time step
for k = 1:1:600
    time(k) = k * ts;
%     rin(k) = 1;% reference input
    % 参考输入（这里使用的是步进输入）
    % 如果需要使用正弦输入，取消下一行的注释
    rin(k) = sin(2 * pi * time(k));

    a(k) = 1.2 * (1 - 0.8 * exp(-0.1 * k));
    yout(k) = a(k) * y_1 / (1 + y_1^2) + u_1;% y_out实际输出
    error(k) = rin(k) - yout(k);% 参考输入（希望的输出）与实际输出的的差
    xi = [rin(k), yout(k), error(k), 1];% 神经网络输入

    % 计算误差历史
    x(1) = error(k) - error_1;
    x(2) = error(k);
    x(3) = error(k) - 2 * error_1 + error_2;
    epid = [x(1); x(2); x(3)];

    % 计算中间层的输入
    I = xi * wi';

    % 中间层的激活函数
    for j = 1:1:H
        Oh(j) = (exp(I(j)) - exp(-I(j))) / (exp(I(j)) + exp(-I(j)));
    end

    % 计算输出层的输入
    K = wo' * Oh;

    % 输出层的激活函数
    for l = 1:1:Out
        K(l) = exp(K(l)) / (exp(K(l)) + exp(-K(l)));
    end

    % 获取PID参数
    kp(k) = K(1); ki(k) = K(2); kd(k) = K(3);
    Kpid = [kp(k), ki(k), kd(k)];

    % 计算控制器输出增量
    du(k) = Kpid * epid;
    u(k) = u_1 + du(k);

    % 限制控制器输出
    if u(k) >= 10
        u(k) = 10;
    end
    if u(k) <= -10
        u(k) = -10;
    end

    % 开始反向传播
    % 计算误差灵敏度
    dyu(k) = sign((yout(k) - y_1) / (u(k) - u_1 + 0.0000001));

    % 计算输出层的误差项
    for j = 1:1:Out
        dK(j) = 2 / (exp(K(j)) + exp(-K(j)))^2;
    end

    for l = 1:1:Out
        delta3(l) = error(k) * dyu(k) * epid(l) * dK(l);
    end

    % 更新输出层权重
    for l = 1:1:Out
        for i = 1:1:H
            d_wo = xite * delta3(l) * Oh(i) + alfa * (wo_1 - wo_2);
        end
    end
    wo = wo_1 + d_wo + alfa * (wo_1 - wo_2);

    % 计算中间层的误差项
    for i = 1:1:H
        dO(i) = 4 / (exp(I(i)) + exp(-I(i)))^2;
    end

    segma = delta3 * wo';
    for i = 1:1:H
        delta2(i) = dO(i) * segma(i);
    end

    % 更新输入到隐藏层的权重
    d_wi = xite * delta2' * xi + alfa * (wi_1 - wi_2);
    wi = wi_1 + d_wi;

    % 更新历史参数
    u_5 = u_4; u_4 = u_3; u_3 = u_2; u_2 = u_1; u_1 = u(k);
    y_2 = y_1; y_1 = yout(k);
    wo_3 = wo_2; wo_2 = wo_1; wo_1 = wo;
    wi_3 = wi_2; wi_2 = wi_1; wi_1 = wi;
    error_2 = error_1;
    error_1 = error(k);
end

% 绘图
figure(1);
plot(time, rin, 'r', time, yout, 'b');
xlabel('time(s)'); ylabel('rin,yout');

figure(2);
plot(time, error, 'r');
xlabel('time(s)'); ylabel('error');

figure(3);
plot(time, u, 'r');
xlabel('time(s)'); ylabel('u');

figure(4);
subplot(311);
plot(time, kp, 'r');
xlabel('time(s)'); ylabel('kp');

subplot(312);
plot(time, ki, 'g');
xlabel('time(s)'); ylabel('ki');

subplot(313);
plot(time, kd, 'b');
xlabel('time(s)'); ylabel('kd');
